from 读写文件 import 读文件, 写文件
from 格式化大小 import 格式化大小
import os

结尾 = ' ' * 5

def 计算平均速度(记录: list[tuple[float, int | float]]) -> int | float:
    if not 记录:
        return 0.0
    return sum([x[2] for x in 记录]) / len(记录)

def 获取速度字符串(记录: list[tuple[float, int | float]]) -> str:
    开始速度 = 格式化大小(记录[1][2])
    最后速度 = 格式化大小(记录[-1][2])
    平均速度 = 格式化大小(计算平均速度(记录))
    最小速度 = 格式化大小(min(记录, key=lambda x: x[2])[2])
    最大速度 = 格式化大小(max(记录, key=lambda x: x[2])[2])
    return f'开始速度: {开始速度}/s, 最后速度: {最后速度}/s, 平均速度: {平均速度}/s, 最小速度: {最小速度}/s, 最大速度: {最大速度}/s'

def 测速(
    路径: str,
    大小: int,
    块大小: int=1024 * 1024,
    滑动窗口: float=1.0,
):
    大小字符串 = 格式化大小(大小)
    print(f'开始测速, 文件: {路径}, 大小: {大小字符串}')

    def 回调(记录: list[tuple[float, int | float]]):
        时间, 已写入, 速度 = 记录[-1]
        平均速度 = 格式化大小(计算平均速度(记录))
        百分比 = int(100.0 * 已写入 / 大小)
        进度 = f'[{格式化大小(已写入)}/{大小字符串} {百分比:.2f}%]'
        print(f'\r实时速度: {格式化大小(速度)}/s, 平均速度: {平均速度}/s, {进度}', end=结尾, flush=True)
    
    记录1, 耗时1 = 写文件(路径, 大小, 块大小, 滑动窗口, 回调)
    print(f'\r写入完成, 耗时: {耗时1:.2f}s, {获取速度字符串(记录1)}')

    input('按任意键继续读取(可重新挂载清除缓存)...')

    记录2, 耗时2 = 读文件(路径, 块大小, 滑动窗口, 回调)
    print(f'\r读取完成, 耗时: {耗时2:.2f}s, {获取速度字符串(记录2)}')

    os.remove(路径)

if __name__ == "__main__":
    测速('/Volumes/Lenovo K120/test.txt', 1024 * 1024 * 1024 * 1)
